{
    attributes: {
      "dataSource.category": "security",
      "dataSource.name": "Corelight",
      "dataSource.vendor": "Corelight",
      "class_uid": 4001,
      "category_uid": 4,
      "severity_id": 1,
      //"severity": "Informational",
      "class_name": "Network Activity",
      "category_name": "Network Activity",
      "metadata.product.name": "Corelight",
      "metadata.product.vendor_name": "Corelight",
      "metadata.version": "27.12.0",
      //"metadata.log_name": "conn",
      "app_name": "Corelight"
    },
    formats: [
      {
        format: "${parse=dottedJson}$",
        repeat: true
        rewrites: [
          {
            input: "_path",
            output: "metadata.log_name",
            match: ".*",
            replace: "$0"
          }, {
            input: "severity.name",
            output: "severity",
            match: "(\\w+).*",
            replace: "$1",
            outputIfNoMatch: false
          }, {
            input: "ts",
            output: "timestamp",
            match: ".*",
            replace: "$0"
          }, {
            input: "ts",
            output: "time",
            match: ".*",
            replace: "$0"
          }, {
            input: "uid",
            output: "metadata.uid",
            match: ".*",
            replace: "$0"
          }, {
            input: "uid",
            output: "uuid",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.orig_ep_uid",
            output: "agent.uuid",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.orig_ep_name",
            output: "endpoint.name",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.orig_h",
            output: "src_endpoint.ip",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.orig_p",
            output: "src_endpoint.port",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.orig_ep_uid",
            output: "src_endpoint.uid",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.orig_ep_name",
            output: "src_endpoint.name",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.resp_h",
            output: "dst_endpoint.ip",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.resp_p",
            output: "dst_endpoint.port",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.resp_ep_uid",
            output: "dst_endpoint.uid",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.resp_ep_name",
            output: "dst_endpoint.name",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.vlan",
            output: "dst_endpoint.vlan_uid",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.inner_vlan",
            output: "src_endpoint.vlan_uid",
            match: ".*",
            replace: "$0"
          }, {
            input: "proto",
            output: "network_connection_info.protocol_name",
            match: ".*",
            replace: "$0"
          }, {
            input: "orig_bytes",
            output: "traffic.bytes_out",
            match: ".*",
            replace: "$0"
          }, {
            input: "resp_bytes",
            output: "traffic.bytes_in",
            match: ".*",
            replace: "$0"
          }, {
            input: "conn_state",
            output: "activity_id",
            match: "^(S0|S2|S3)$",
            replace: 4
          }, {
            input: "conn_state",
            output: "activity_name",
            match: "^(S0|S2|S3)$",
            replace: "Fail"
          }, {
            input: "conn_state",
            output: "type_uid",
            match: "^(S0|S2|S3)$",
            replace: 400104
          }, {
            input: "conn_state",
            output: "activity_id",
            match: "S1",
            replace: 1
          }, {
            input: "conn_state",
            output: "activity_name",
            match: "S1",
            replace: "Open"
          }, {
            input: "conn_state",
            output: "type_uid",
            match: "S1",
            replace: 400101
          }, {
            input: "conn_state",
            output: "activity_id",
            match: "SF",
            replace: 6
          }, {
            input: "conn_state",
            output: "activity_name",
            match: "SF",
            replace: "Traffic"
          }, {
            input: "conn_state",
            output: "type_uid",
            match: "SF",
            replace: 400106
          }, {
            input: "conn_state",
            output: "activity_id",
            match: "REJ",
            replace: 5
          }, {
            input: "conn_state",
            output: "activity_name",
            match: "REJ",
            replace: "Refuse"
          }, {
            input: "conn_state",
            output: "type_uid",
            match: "REJ",
            replace: 400105
          }, {
            input: "conn_state",
            output: "activity_id",
            match: "^(RSTO|RSTR|RSTOS0|RSTRH)$",
            replace: 3
          }, {
            input: "conn_state",
            output: "activity_name",
            match: "^(RSTO|RSTR|RSTOS0|RSTRH)$",
            replace: "Reset"
          }, {
            input: "conn_state",
            output: "type_uid",
            match: "^(RSTO|RSTR|RSTOS0|RSTRH)$",
            replace: 400103
          }, {
            input: "conn_state",
            output: "activity_id",
            match: "^(SH|SHR)$",
            replace: 0
          }, {
            input: "conn_state",
            output: "activity_name",
            match: "^(SH|SHR)$",
            replace: "Unknown"
          }, {
            input: "conn_state",
            output: "type_uid",
            match: "^(SH|SHR)$",
            replace: 400100
          }, {
            input: "conn_state",
            output: "activity_id",
            match: "OTH",
            replace: 0
          }, {
            input: "conn_state",
            output: "activity_name",
            match: "OTH",
            replace: "Other"
          }, {
            input: "conn_state",
            output: "type_uid",
            match: "OTH",
            replace: 400199
          }, {
            input: "orig_pkts",
            output: "traffic.packets_out",
            match: ".*",
            replace: "$0"
          }, {
            input: "resp_pkts",
            output: "traffic.packets_in",
            match: ".*",
            replace: "$0"
          }, {
            input: "orig_l2_addr",
            output: "src_endpoint.mac",
            match: ".*",
            replace: "$0"
          }, {
            input: "resp_l2_addr",
            output: "dst_endpoint.mac",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.orig_ep_type",
            output: "endpoint.type",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.orig_ep_ostype",
            output: "endpoint.os",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.orig_ep_type",
            output: "src_endpoint.type",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.orig_ep_ostype",
            output: "src_endpoint.os",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.resp_ep_type",
            output: "dst_endpoint.type",
            match: ".*",
            replace: "$0"
          }, {
            input: "id.resp_ep_ostype",
            output: "dst_endpoint.os",
            match: ".*",
            replace: "$0"
          }
        ]
      }
    ]
  }
  